brew "aws-vault"
brew "cairo"
brew "cocoapods"
brew "gemini-cli"
brew "llmfit"
brew "mas"
brew "ollama", restart_service: :changed
brew "openai-whisper"
brew "poppler"
brew "rabbitmq"
brew "tectonic"
brew "watson"

cask "dbeaver-community"
cask "mysqlworkbench"
cask "obsidian"
cask "orbstack"
cask "pgadmin4"
cask "proxyman"
cask "raycast"
cask "slack"
cask "tabby"

mas "Compressor", id: 6746516157
mas "iHosts", id: 1102004240
mas "Pixelmator Pro", id: 6746662575
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835

# cargo "mdbook"
# cargo "mdbook-admonish"
# cargo "mdbook-alerts"
# cargo "mdbook-d2"
# cargo "mdbook-d2-png"
# cargo "mdbook-emojicodes"
# cargo "mdbook-epub"
# cargo "mdbook-linkcheck"
# cargo "mdbook-pandoc"
# cargo "mdbook-pdf"

uv "mdformat"
uv "nano-pdf"
