tap "antoniorodr/memo"
tap "chef/chef"
tap "cloudflare/cloudflare"
tap "openhue/cli"
tap "steipete/tap"
tap "xdevplatform/tap"
tap "yakitrak/yakitrak"

# Language and version managers like rbenv, tfenv, go, openjdk, yarn are omitted 
# as they are better managed by mise.

brew "tree"
brew "ansible"
brew "awscli"
brew "bat"
brew "bat-extras"
brew "cairo"
brew "checkov"
brew "cloudflared"
brew "cocoapods"
brew "curl"
brew "dive"
brew "eza"
brew "fzf"
brew "gemini-cli"
brew "git-extras"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kustomize"
brew "librsvg"
brew "llmfit"
brew "mas"
brew "neovim"
brew "nmap"
brew "ollama", restart_service: :changed
brew "openai-whisper"
brew "pandoc"
brew "pkgconf"
brew "poppler"
brew "pre-commit"
brew "rabbitmq"
brew "ripgrep"
brew "ripgrep-all"
brew "starship"
brew "stern"
brew "tectonic"
brew "testdisk"
brew "trivy"
brew "uv"
brew "watch"
brew "watchman"
brew "watson"
brew "wget"
brew "yq"
brew "zoxide"
brew "antoniorodr/memo/memo"
brew "steipete/tap/gogcli"
brew "steipete/tap/imsg"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/spogo"
brew "steipete/tap/summarize"

cask "android-studio"
cask "caffeine"
cask "dbeaver-community"
cask "font-monaspace"
cask "ghostty"
cask "mysqlworkbench"
cask "obsidian"
cask "pgadmin4"
cask "slack"
cask "tabby"
cask "telegram-desktop"
cask "vlc"
cask "xdevplatform/tap/xurl"

mas "Balatro", id: 6502451661
mas "Capo", id: 696977615
mas "CivilizationVII", id: 6744373452
mas "Clockify Desktop", id: 1364502317
mas "Compressor", id: 6746516157
mas "Cult Of The Lamb", id: 1639580858
mas "Designs for iBooks Author", id: 519626160
mas "Final Cut Pro", id: 1631624924
mas "iHosts", id: 1102004240
mas "Keynote", id: 361285480
mas "Logic Pro", id: 1615087040
mas "MainStage", id: 6746637089
mas "Motion", id: 6746637149
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Pixelmator Pro", id: 6746662575
mas "Simple Comic", id: 1497435571
mas "Snake.io+", id: 6443553808
mas "Toggl Track", id: 1291898086
mas "Trello", id: 1278508951
mas "Unsplash Wallpapers", id: 1284863847
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835

vscode "4ops.terraform"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "cstuder.gitlab-ci-validator"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ftonato.password-generator"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "m4ns0ur.base64"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.powershell"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "pomber.git-file-history"
vscode "renkun.reader"
vscode "repreng.csv"
vscode "samuelcolvin.jinjahtml"
vscode "seyyedkhandon.gpack"
vscode "tamasfe.even-better-toml"
vscode "the0807.uv-toolkit"
vscode "tomoki1207.pdf"
vscode "yzhang.markdown-all-in-one"