tap "cloudflare/cloudflare"

brew "ansible"
brew "awscli"
brew "bat-extras"
brew "bat"
brew "checkov"
brew "cloudflared"
brew "commitlint"
brew "conftest"
brew "curl"
brew "direnv"
brew "dive"
brew "eza"
brew "zsh-fast-syntax-highlighting"
brew "fzf"
brew "gh"
brew "git-extras"
brew "gitleaks"
brew "hadolint"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "krew"
brew "kubeconform"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "librsvg"
brew "mise"
brew "mosh"
brew "neovim"
brew "nmap"
brew "pandoc"
brew "pkgconf"
brew "pre-commit"
brew "ripgrep-all"
brew "ripgrep"
brew "starship"
brew "stern"
brew "terraform-docs"
brew "testdisk"
brew "tmux"
brew "tree"
brew "trivy"
brew "uv"
brew "watch"
brew "watchman"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"

vscode "4ops.terraform"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "cstuder.gitlab-ci-validator"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ftonato.password-generator"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "m4ns0ur.base64"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.powershell"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "pomber.git-file-history"
vscode "renkun.reader"
vscode "repreng.csv"
vscode "samuelcolvin.jinjahtml"
vscode "seyyedkhandon.gpack"
vscode "tamasfe.even-better-toml"
vscode "the0807.uv-toolkit"
vscode "tomoki1207.pdf"
vscode "yzhang.markdown-all-in-one"
uv "ruff"
