tap "antoniorodr/memo"
tap "chef/chef"
tap "openhue/cli"
tap "steipete/tap"
tap "xdevplatform/tap"
tap "yakitrak/yakitrak"

brew "aws-vault"
brew "cairo"
brew "cocoapods"
brew "gemini-cli"
brew "llmfit"
brew "mas"
brew "ollama", restart_service: :changed
brew "openai-whisper"
brew "poppler"
brew "rabbitmq"
brew "tectonic"
brew "watson"
brew "antoniorodr/memo/memo"
brew "steipete/tap/gogcli"
brew "steipete/tap/imsg"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/spogo"
brew "steipete/tap/summarize"

cask "dbeaver-community"
cask "mysqlworkbench"
cask "obsidian"
cask "orbstack"
cask "pgadmin4"
cask "proxyman"
cask "raycast"
cask "slack"
cask "tabby"
cask "xdevplatform/tap/xurl"

mas "Compressor", id: 6746516157
mas "Final Cut Pro", id: 1631624924
mas "iHosts", id: 1102004240
mas "Keynote", id: 361285480
mas "Logic Pro", id: 1615087040
mas "MainStage", id: 6746637089
mas "Motion", id: 6746637149
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Pixelmator Pro", id: 6746662575
mas "Toggl Track", id: 1291898086
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835

vscode "astro-build.astro-vscode"

cargo "mdbook"
cargo "mdbook-admonish"
cargo "mdbook-alerts"
cargo "mdbook-d2"
cargo "mdbook-d2-png"
cargo "mdbook-emojicodes"
cargo "mdbook-epub"
cargo "mdbook-linkcheck"
cargo "mdbook-pandoc"
cargo "mdbook-pdf"

uv "mdformat"
uv "nano-pdf"
