brew "asciinema"
brew "aws-vault"
brew "cairo"
brew "cocoapods"
brew "gemini-cli"
brew "llmfit"
brew "mas"
brew "ollama", restart_service: :changed
brew "openai-whisper"
brew "poppler"
brew "rabbitmq"
brew "tectonic"
brew "vhs"
brew "watson"
# brew "gnupg"

cask "dbeaver-community"
cask "mysqlworkbench"
cask "obsidian"
cask "pgadmin4"
cask "proxyman"
cask "raycast"
cask "slack"
cask "tabby"

cask "caffeine"
cask "font-monaspace"
cask "ghostty"
cask "vlc"

cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-noto-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-zed-mono-nerd-font"

mas "Compressor", id: 6746516157
mas "iHosts", id: 1102004240
mas "Pixelmator Pro", id: 6746662575
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835

# cargo "mdbook"
# cargo "mdbook-admonish"
# cargo "mdbook-alerts"
# cargo "mdbook-d2"
# cargo "mdbook-d2-png"
# cargo "mdbook-emojicodes"
# cargo "mdbook-epub"
# cargo "mdbook-linkcheck"
# cargo "mdbook-pandoc"
# cargo "mdbook-pdf"

uv "mdformat"
uv "nano-pdf"
